help.org
#+STARTUP: showeverything
#+PROPERTY: results output silent
* README

HELP Enables Literate Programming.

Setup:

1) [[http://orgmode.org/][Pull Org-Mode]] to =~/src/=.
   1) If necessary: [[http://orgmode.org/worg/org-hacks.html][Generating autoloads and Compiling Org without make]]
2) [[https://github.com/jwiegley/use-package][Pull Use-Package]] to =~/src/=.
3) Create a folder for support libraries exporting it's location in a variable
   named =EELIB=.
   1) Install [[http://ditaa.sourceforge.net/][DITAA]] renaming the JAR to =ditaa.jar=.
   2) Install [[http://plantuml.com/][PlantUML]] renaming the JAR to =plantuml.jar=.
4) Install supporting systems adding their exectuables to the =PATH=.
   1) [[https://www.oracle.com/java/index.html][Oracle Java]].
5) Link.
   - The Eshell directory to HELP's.
     - =ln -s ~/src/help/eshell/ ~/.emacs.d/eshell=
   - The Init file to HELP's.
     - =ln -s ~/src/help/.emacs.el ~/.emacs.el=

* Style Guide

- Code Block
  - Tell the story in speech, and then in code.
  - Consider it another paragraph and indent appropriately.
  - When contained within a list.
    - Indent begin/end blocks with list content; this makes it clear to Org-Mode
      to export it as a code block.
    - Source code is indented according to existing settings. This system keeps
      it left-aligned, saving space.
- Content
  - When importing, update to conform with Style-Guide.
- Dictionary
  - Exemple Complet Minimal (ECM) :: The minimal complete example of expected
    versus actual behavior. Comes from the [[http://orgmode.org/worg/org-faq.html][Org-Mode]] community.
  - Key-Bind :: A verb. The act of creating a Key Binding.
  - Literate Programming (LP) :: As Knuth intended.
  - Out of the Box (OOTB) :: The default configuration of something.
  - Sysop :: A proper noun. The System-Operator. The human operating this EMACS
    based Org-Mode enabled literate programming system. The reader.
  - Tangle :: A verb. Assemble a document for consumption by another program or
    machine.
  - Weave :: A verb. Prepare a document for consumption by a human.
- File/Package Loading
  - Load every one with ~use-package~ whether it came with EMACS OOTB or ELPA.
    - ~ensure~ tells the reader which one it came from.
- Formatting
  - Code Snippet.
    - Programming language expressions.
    - Use ~code style~.
  - Non-Code Snippet.
    - Program names, file types
    - Use =verbatim= style
  - Package.
    - Same as Headline.
    - Dashes separate definition.
    - Acronyms are all upper case to distinguish from words for example "GNU"
      vs "Gnu".
- Headline.
  - Capitalize nouns, verbs, and adjectives.
  - Don't capitalize conjunctions unless they are starting the definition.
  - Sell this "chapter" to the reader.
  - Some headlines will be empty and significant; keep them.
    - Some modes don't require any configuration. The headline still needs to be
      present to remind Sysop to keep it in her cognitive landscape.
    - Configure other properties and modes taking it into account.
    - Pros:
      - For example:
        - Every language under Hacking should show up in
          ~org-babel-load-languages~.
      - The Prog*-Mode system configuration can result in Headlines that don't
        need any configuration. The Headline still communicates the mode's
        value to Sysop even if it doesn't configure EMACS.
    - Cons:
      - Gives reader impression that modes are configured and ready to use.
  - It is important to include headlines that are empty and that you may not
    even end up keeping. You need them to help you explore the cognitive
    landscape with them present. In this one case, premature optimization is
    /not/ the root of all evil.
  - Sometimes headlines might better be:
    - List items.
    - Stand-alone bold'ed text without punctuation.
- Hyperlink.
  - External.
    - Exclude those easily found with a search-engine unless you are willing to
      verify their existence frequently.
    - Include when they make the task at hand immensely easier.
  - Internal.
    - Heading artifacts can be referenced so the need here is minimal to
      non-existent.
- Literate Programming.
  - Comments.
    - Exclude from tangle-blocks and rely on source-block for traceability.
  - Noweb-Ref.
    - Same as Headline.
    - Replace spaces with dashes.
    - Probably the Heading name.
    - Keep depth shallow
- Maintenance.
  - Frequently check spelling, grammar, and weasel-words.
- Plain List.
  - End single sentences with a period.
- Programming Language.
  - Emacs-Lisp.
    - Use ~t~ for ~true~.
    - Almost always use ~defun~ instead of ~advice-add~.
      - Functions are more normal and predictable.
      - Advice can subtly break without you noticing.
    - Paramemter.
      - ~nil~ for =FALSE=.
      - ~t~ for =TRUE=.
      - ~n~ for numerical values.
    - Try never to advise functions.
    - Never ~custom-set-variables~.
  - Always use relative file paths.
- Tangling.
  - When ordering matters, rely on block-reuse to enforce correct generation.
- Voice.
  - Provide answers; do not pose questions or observations.
  - Simple and detailed.
  - Pleasant conversation style.
  - Audience is Sysop; the author included.
- Word Choice.
  - Use Arabic numerals.
  - Instead of writing "tells EMACS", communicate the result.
  - "EMACS" refers to this software.
  - "This system" refers to this configuration of EMACS.

* Webs We Weave

** Org-Mode Exemple Complet Minimal
   :PROPERTIES:
   :noweb-ref: Org-Mode-ECM-Tangle-Block
   :tangle:  "./.org-mode-ecm.emacs.el"
   :comments: no
   :END:

Configure EMACS to easily provide ECMs.

Sysop is likely to use this often.

Start EMACS with this command:

=open /Applications/Emacs.app --args --quick --load ~/src/help/.org-mode-ecm.emacs.el=

#+BEGIN_SRC emacs-lisp
«Principle-of-Least-Astonishment»
«Org-Mode-ECM»
#+END_SRC

#+NAME:

** The Whole Enchilada
   :PROPERTIES:
   :tangle:  "./.emacs.el"
   :comments: no
   :END:

Configure EMACS to do everything provided by this document.

Sysop is likely to use this hourly.

Start EMACS with this command:

#+BEGIN_SRC emacs-lisp
«Org-Mode-ECM-Tangle-Block»
«Org-Mode-Helper-Functions»
«Org-Mode-Tangle»
«Org-Mode-Execute»
«Org-Mode-Weave»
«Watch-What-You-Eat»
«Special-Operating-Procedure»
«Standard-Operating-Procedure»
«Hacking-Prog*-Mode»
«Hacking-Emacs-Lisp»
«Hacking-Org-Mode»
«Hacking-YASnippet»
«Hacking-Publishing-TeX»
«Hacking-Artist»
«Hacking-DITAA»
«Hacking-PlantUML»
«Quiet-and-Pleasant-Appearance»
«Piano-Lessons»
#+END_SRC

=open /Applications/Emacs.app=

** Eshell

#+BEGIN_SRC sh :tangle "./eshell/alias" :comments no :eval no
alias clear recenter 0
alias d 'dired $1'
alias ff find-file $1
alias gb git branch $*
alias gpom git push origin master
alias gst git status
alias la ls -lha $*
alias ll ls -lh $*
#+END_SRC

* Literate Programming

This system enables you to perform 3 Literate Document activities. These
activities combine to provide a rich Literate Programming environment. Their
configuration is defined with more granularity here to make sense of how the
system is configured, where, and how it works. These activities are not
performed interactively by the user. They are automatic operations that occur
as a result of the configuration of the document itself.

The following is the guide for the default configuration of this system and how
it behaves.

Key:

- Columns
  - S :: Source document modified?
  - W :: Destination weaved-document modified?
  - T :: Destination tangled-document modified?
  - E :: Evaluation occurred?

| Activity   | S | W | T | E |
|------------+---+---+---+---|
| Tangling   | F | F | T | F |
| Evaluating | T | F | F | T |
| Exporting  | F | T | F | F |

They are separate and distinct operations and are defined as such.

The last logical action is the activity of "Programming". It is a combination of
three 3 activities listed above combined with the configuration of EMACS to do
so. This is an interactive activity performed Sysop. The results of Sysop's
activities are contained within the document. Those contents are input for the
activities here.

** Org-Mode Exemple Complet Minimal
   :PROPERTIES:
   :noweb-ref: Org-Mode-ECM
   :END:

A stable version of Org-Mode is provided OOTB. It's release cycle is tied to
EMACS release cycle. To get hot-fixes, cutting edge features, and easy patch
creation though, you need to use the version from Git.

The [[http://orgmode.org/manual/Installation.html][directions]] of how to run Org-Mode from Git are detailed and clear. The only
thing worth mentioning again is that in order to use *any* version of Org-Mode
other than the one that comes OOTB you *must* load Org-Mode *before* anything else
in your initialization file. This can be surprisingly easy to do! When you get
unexpected Org-Mode behavior be sure to stop and investigate ~org-version~ and
decide whether or not it is what you expect and prepare an ECM if necessary.

Add the Org-Mode core distribution the load path.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/src/org-mode/lisp")
#+END_SRC

Add the Org-Mode-Contributions distribution to the load path. The contributions
are critical to and inseparable from the core distribution.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/src/org-mode/contrib/lisp")
#+END_SRC

This system allows for single-character alphabetical bullet lists. For Org-Mode
to provide that, the following property must exist before Org-Mode is even
loaded. This configuration must occur here. *Never* remove this from a submitted
ECM.

#+BEGIN_SRC emacs-lisp
(setq org-list-allow-alphabetical t)
#+END_SRC

Load Org-Mode.

#+BEGIN_SRC emacs-lisp
(require 'org)
#+END_SRC

Org-Mode already uses the guillemot for demarcating noweb references, but it
does it using the work-around of just using less-than and greater-than
characters twice. That is fine. Because EMACS supports Unicode just fine though,
configure Org-Mode to use the real symbol. Another option would be to configure
Pretty-Mode. This is in the ECM section because so that I can verify behavior of
my code.

#+BEGIN_SRC emacs-lisp
(setq org-babel-noweb-wrap-start "«")
(setq org-babel-noweb-wrap-end "»")
#+END_SRC

